TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l222x.h
/* IOMUX_PINCM70[PF] Bits */
#define IOMUX_PINCM70_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM70_PF_GPIOB_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM70_PF_UART0_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM70_PF_SPI0_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM70_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM70_PF_TIMA_FAULT1                  ((uint32_t)0X00000005)
#define IOMUX_PINCM70_PF_TIMA_FAULT2                  ((uint32_t)0X00000006)
#define IOMUX_PINCM70_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM70_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000008)

/* IOMUX_PINCM71[PF] Bits */
#define IOMUX_PINCM71_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM71_PF_GPIOB_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM71_PF_UART0_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM71_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM71_PF_TIMA0_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM71_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM71_PF_TIMG4_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM71_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM71_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000008)

/* IOMUX_PINCM72[PF] Bits */
#define IOMUX_PINCM72_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM72_PF_GPIOB_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM72_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM72_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM72_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000004)
#define IOMUX_PINCM72_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM72_PF_TIMG4_CCP1                   ((uint32_t)0X00000006)

/* IOMUX_PINCM73[PF] Bits */
#define IOMUX_PINCM73_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM73_PF_GPIOA_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM73_PF_UART3_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM73_PF_SPI1_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM73_PF_TIMG8_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM73_PF_TIMA_FAULT0                  ((uint32_t)0X00000005)
#define IOMUX_PINCM73_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM73_PF_TIMG5_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM73_PF_UART2_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM73_PF_UART3_RX                     ((uint32_t)0X00000009)
#define IOMUX_PINCM73_PF_TIMG4_CCP1                   ((uint32_t)0X0000000A)

/* IOMUX_PINCM74[PF] Bits */
#define IOMUX_PINCM74_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM74_PF_GPIOA_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM74_PF_UART3_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM74_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM74_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM74_PF_TIMA_FAULT2                  ((uint32_t)0X00000005)
#define IOMUX_PINCM74_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM74_PF_TIMG5_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM74_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000008)
#define IOMUX_PINCM74_PF_COMP0_OUT                    ((uint32_t)0X00000009)


#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/*@}*/ /* end of group MSPM0L222X_PeripheralDecl */

/*@}*/ /* end of group MSPM0L222X_Definitions */

#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_m0p_mspm0l222x__include */